In [ ]:
Use loc for label-based selection, where you specify rows and columns by their labels.
Use iloc for integer-based selection, where you specify rows and columns by their integer positions

In [12]:
import pandas as pd

In [17]:
dict1 ={"name":["Umesh","Kusum","Vivek","Sonam"], "Age":[33,29,23,26]}
df = pd.DataFrame({"name":["Umesh","Kusum","Vivek","Sonam"], "Age":[33,29,23,26]}, index=['x','y','z','w'])

In [18]:
df

    name  Age
x  Umesh   33
y  Kusum   29
z  Vivek   23
w  Sonam   26

In [25]:
df.loc["x":"z"]

    name  Age
x  Umesh   33
y  Kusum   29
z  Vivek   23

In [27]:
df.loc["x","name"]

'Umesh'

In [31]:
df1 = pd.DataFrame({"name":["Umesh","Kusum","Vivek","Sonam"], "Age":[33,29,23,26]})

In [32]:
df1

    name  Age
0  Umesh   33
1  Kusum   29
2  Vivek   23
3  Sonam   26

In [33]:
df1.iloc[0:2]

    name  Age
0  Umesh   33
1  Kusum   29

In [34]:
df1.iloc[-1]

name    Sonam
Age        26
Name: 3, dtype: object

In [43]:
df1.iloc[0,0]

'Umesh'

In [44]:
df1.iloc[1,0]

'Kusum'

In [45]:
df1.iloc[1,1]

29

In [49]:
df1[df1["Age"]>27]

    name  Age
0  Umesh   33
1  Kusum   29